# 个人信息补充
SELF_ID_DEFAULT = "wxminer"
SELF_NAME_DEFAULT = "WX Miner"
SELF_HEADIMG_DEFAULT = "https://res.wx.qq.com/a/wx_fed/assets/res/OTE0YTAw.png"

# 常规消息类型
MESSAGE_TYPE = {
    1: "文本",
    3: "图片",
    34: "语音",
    42: "名片",
    43: "视频",
    47: "表情",
    48: "位置",
    49: "应用消息",
    10000: "系统消息",
    10002: "群聊通知",
}

# 扩展消息类型（常规类型=49的应用消息）
MESSAGE_TYPE_EXT = {
    4: "哔哩哔哩分享视频",
    5: "公众号分享消息",
    5: "链接消息",
    5: "外部应用分享消息",
    6: "文件",
    8: "待下载表情",
    17: "位置共享",
    19: "消息记录",
    24: "收藏",
    33: "小程序",
    36: "外部应用分享小程序",
    51: "视频号视频",
    53: "接龙",
    54: "视频号视频",
    57: "引用",
    62: "拍一拍",
    63: "视频号直播",
    76: "QQ音乐",
    2000: "转账",
    2001: "红包",
    2001: "群收款",
}